
profs(['BritneySpears','AvrilLavigne','BrunoMars','Eminem','KetyPerry','Rihanna','TaylorSwift','SelenaGomez','LinkinPark']).
curso(1,'中文').
curso(2,'英文').
curso(3,'法文').
curso(4,'德文').
curso(5,'葡萄牙文').
curso(6,'西班牙文').
curso(7,'意大利文').
curso(8,'俄文').
curso(9,'韩文').
curso(10,'印度文').
curso(11,'阿拉伯文').
curso(12,'孟加拉文').
curso(13,'丹麦文').
curso(14,'瑞典文').
curso(15,'爱尔兰文').
curso(16,'罗马尼亚文').

/*
curso_prof([1,3,5,12],         			%Britney Spears
		   [1,3,4,6,9],        		    %Avril Lavigne
		   [2,4,8,10,11],      		    %Bruno Mars
		   [5,13,15,16],       		    %Eminem
		   [3,7,14,15,16],      		%Kety Perry
		   [1,2,4,6,7,9,13],   		    %Rihanna
		   [3,4,7,9,10,11],             %Taylor Swift
		   [3,8,9,12,13,14,15],         %Selena Gomez
		   [2,5,6,8,10,11,12,14,16]).   %Linkin Park
*/
   
indisp_prof_curso([[3,4,5,7,8,9],[1,2,4,5,7,8],[3,4,6,9],[1,4,5,8,9],
                   [2,3,5,6,7,8],[1,3,4,5,7,8],[1,2,3,4,8,9],[1,2,4,5,6,7],
				   [1,3,4,5,9],[1,2,4,5,6,8],[1,2,4,5,6,8],[2,3,4,5,6,7],        %15 secondos
				   [1,2,3,5,7,9],[1,2,3,4,6,7],[1,2,3,6,7,9],[1,2,3,6,7,8]]).    %60-70 e tal secondos
		   
preco_prof([80,90,85,75,95,80,85,75,100]).

max_hextra(100).
max_hpt(60).

% Curso-Vaga
caso1([1-15,3-15,5-15,7-12,8-15,11-9,13-13,15-12,16-15]).
caso2([1-23,4-18,5-14,7-20,8-15,9-10,12-25,14-23,15-20,16-22]).
caso3([2-19,3-18,4-15,5-10,7-19,8-12,9-9,11-6,12-12,13-14,14-15]).
caso4([2-7,3-12,4-6,6-13,8-12,9-10,10-3,11-14,12-5,13-6,15-8,16-9]).
